import { Image, StyleSheet, View } from 'react-native'
import React from 'react'
import { Divider, MainHeader, Screen, Text } from '../../../components'
import { colors } from '../../../theme'

export function PrivacyScreen() {
    return (
        <Screen withoutScroll>
            <MainHeader title="قوانین و مقررات" />
            <View style={{ width: '100%', paddingVertical: 20, backgroundColor: colors.pallete.gray1 }}>
                <Image style={{ width: '100%' }} source={require('../../../assets/images/hlogo.png')} />
            </View>
            <Screen unsafe style={{paddingHorizontal:15}}>
                <Text color={colors.pallete.red}>به ماهم خوش آمدید</Text>
                <Divider />
                <Text size={15} >آگهی دادن و ثبت آگهی در اپلیکیشن ماهـم ، تابع قوانین و مقرراتی است
                    .و متن کلیه آگهی‌ها باید از این قوانین پیروی کنند
                    اگر آن‌ها را رعایت کنید، مطمئناً باعث سرعت گرفتن ثبت آگهی‌تان خواهد
                    شـد. ایـن قـوانین را بـرایتان آورده‌ایم تا هنگام تنظیم آگهی خـود، آن‌ها را
                    .مد نظر داشته باشید
                    آگهی دهنـده در مقابـل آگهـی خـود مسئـول و متعهد می باشـد و مسایل
                    قانونی ناشی از انتشار هر گونه آگهی كه موجب خسارت معنـوی و یا مـادی
                    بـرای شخص یا اشخاصی گـردد ، مستقیما متـوجه سفارش دهنـده آگهـی
                    .خواهـد بود
                    ثبت آگهی در ماهـم  به معنای به رسمیت شناختن فعالیت ، خدمات و یا =
                    .موضوعات درج شده در آگهی از طرف ماهـم نمی باشد
                    ماهـم ممکن است كه در هـر زمـانی نسبت به تغییـر و یا اصلاح قـوانین =
                    .اقـدام نمایـد که مـوارد اصلاح شـده در ماهـم اعلام خواهـد شـد
                    ثبت نام و درج آگهـی و یا پرداخت وجه توسـط آگهــی دهنده بـه منزله =
                    .قبـول و تاییـد تمامـی قـوانین و شرایـط ماهـم می باشـد
                    ماهـم در قبـال محتـوا، فعالیت ها یا عـدم فعالیـت ها و آگهـی هایی که =
                    .کاربـران در ماهـم قـرار داده اند، هیچ مسئولیتی نمی پذیـرد
                    در صورتیکه کاربری الزامات قانونی خود را زیر پا بگذارد، به حقوق معنوی =
                    و یا قانونی شخص ثالث تجاوز کند، شرکت ماهـم میتواند خدمات و حساب
                    .کاربـردی کاربـر را محدود یا مسدود کنـد
                    مـا هیـچ کنترلی روی کالای تبلیغ شـده از هیـچ نظـر، اعـم از کیفیت و =
                    استاندارد و رعایت قوانین گمرکی و غیره و نیز درستی یا قانونی بودن موارد
                    یا خدمـاتی که در آگهی به آن‏ها اشاره شده، و واقعیت یا صحت مضامین یا
                    آگهی‏ های کاربـران نداشته و مسئولیـت بررسی و تحقیق راجع بـه آن‏ها با
                    .خود کاربـران است. ایـن اپلیکیشن صـرفاً محلی بـرای درج آگهی‏ ها اسـت
                    در نظـر داشته باشید، بـه منظور تسهیل و تسریع فـرآیند تأییـد و انتشار =
                    آگهی‌ها، ماهم ممکن است در مواردی بر اساس قوانین، متن یا عنوان آگهی
                    .شما را به طور جزئی تغییر دهد


                    .در مـورد درج آگهی استخـدام، ارائه مـوارد زیـر ضـروری است
                    عنوان شغلی مورد نیاز =
                    نام کامل شرکت استخدام کننده =
                    آدرس دقیق شرکت =
                    شماره تلفن ثابت به همراه نام شخص پاسخگو =


                    .رعایت کلیه قوانین عمومی و عرف در کشور (مانند موارد زیر) الزامی است
                    .مغایرت با قوانین جاری جمهوری اسلامی ایران و عرف جامعه =
                    آگهی نباید موجب توهین به ادیان رسمی کشـور، آداب، رسوم، قومیت ها =
                    .لهجه ها و گویش های مختلف شود
                    در آگهـی یک کالا و یا خدمـات خاص نباید تلویحا و یا تصـریحا کالا و یا =
                    .خدمـات مشابه دیگر نفی شـود
                    .آگهی نباید تولیدات داخلی را بی ارزش نمایـد =
                    .استفاده ابـزاری از تصاویـر اشخاص در آگهی =
                    معرفی اپلیکیشن یا سایت یا کانال تلگرامی که به هر شکلی قصد رقابت با =
                    .ماهـم را دارنـد
                    .درج مکــرر آگهی های یکسان حتی با عناویـن متفاوت در یک روز =
                    .وجـود جملات نادرسـت از نظـر املایی یا نگارشی =
                    استفاده از عبارت ها یا کلماتی مانند: خریـدار، فـروش، ویـژه، رنـد، مفت =
                    .ارزان، نو، زیـر قیمت، استثنائی، حـراج و مـوارد مشابه
                    .درج قیمت در عنوان آگهی =
                    هر نـوع آگهی و خبرپراکنی سیاسی، اجتماعی یا مذهبی که جنبه تجاری =
                    .نداشته باشـد
                    .هـر نـوع مسابقه، قرعه‌کشی و بخت‌آزمایی (با جایـزه یا بدون جایـزه) =
                    .آگهی انجام پروژه‌های دانشجویی و دانش آموزی =
                    خدمات، دفاتـر و شرکت‌های مرتبط با لیزینگ به جز نمایندگی‌های مجاز =
                    .با ارائه مجوز
                    .خریـد و فـروش فیش حج عمره و تمتع =
                    .درخواست کمک‌های نقـدی یا پیش پرداخت بـرای معامله‌های از راه دور =
                    .درج شماره حساب در متن آگهی =
                    ارسال مجـدد یک آگهی‌‌ که از زمـان حذف آن توسط کاربـر، بیش از ۲۴ =
                    .ساعت سپری نشده باشـد

                    تـوجه : در هنگام درج آگهی بـرای گرفتن نتیجه بهتـر سعی کنیـد عنـوان
                    آگهی شما منحصر به فرد باشد مثلا اگر آگهی خود را در چندین اپلیکیشن
                    تبلیغاتی با عنـوان و توضیحات تکـراری و یکسان درج کـرده باشیـد نتیجه
                    خوبی بـرای شما در بر نخواهد داشت توصیه ما به شما این است که در این
                    اپلیکیشن در اول عنـوان آگهـی خود را کـوتاه و خلاقانه انتخاب کـرده و از
                    اصطلاحات تکـراری و کلیشه ای دوری کنید در شرح توضیحات آگهـی نیز
                    سعی بـر این داشته باشید که همیشه خـود را به جای مخاطب قـرار داده و
                    آگهـی خود را بسنجید همیشه به فکـر منافع خود نباشید سعی در بـرطرف
                    سازی نیاز مخاطب یا مشتری را داشته باشیـد اگر با ایـن اهداف آگهی خود
                    را ویرایش کنید آگهی شما یکی از بهترین آگهی ها خواهد بود در ایـن بین
                    .هـدف ما نیز رضایت شما و مخاطب می باشـد

                    شرایط تصاویر آگهی
                    پیشنهاد میکنیم از تصاویـر واقعی، با کیفیت و مرتبط با کالا یا خدماتی که
                    ارایه می نمایید، استفاده کنید. اندازه تصویر می‌بایست حداقل ۶۰۰*۶۰۰ و
                    حجم آن حداکثر ۱۰ مگابایت باشد. چنانچه تصاویـر آگهی شما شامل موارد
                    .زیر باشد، تایید نمی شود
                    .تصویر بیش از حد کوچک یا بی کیفیت =
                    .استفاده ابزاری از تصاویر اشخاص در آگهی =
                    .تصویری که به آگهی مرتبط نباشد =
                    .تصویری که متعلق به آگهی دیگری در ماهم باشد =
                    .بیش از ۲۰٪ تصویر شامل متن باشد =
                    .تصویر نیاز به چرخش داشته باشد =
                    .تصاویری که دارای شماره تماس، ایمیل یا آدرس سایت باشد =
                    .مغایرت محتوای تصویر با شرایط عرف جامعه یا قـوانین جمهوری اسلامی =

                    امن خرید کنید
                    از کسانی خریـد کنیـد که امـکان مـلاقات حضـوری با آنها پیش از انجام =
                    .معامله وجـود داشته باشـد
                    .هرگـز پیش از دریافت کالا هزینه ای پرداخت نکنیـد =
                    اگر فروشنده اطلاعات شخصی یا اطلاعات حساب بانکی خود را ارائه کـرد =
                    دلیل کافی بـرای اعتماد نیست. ممکن است اطلاعات شخص دیگری مـورد
                    .سـو استفاده قـرار گـرفته باشـد
                    .پس از خریـد کالا رسید کتبی معتبر از فـرد اخذ کنیـد =

                    بخاطر داشته باشید
                    در صورت ایجاد مزاحمت برای شما، می توانید با مراجعه به پلیس فتا، محل
                    .سکونت خـود موضـوع را از آن طریـق پیگیری کنیـد
                    پلیس فتا گنبد: میدان17شهریور- بلوار انتظامی- جنب انتظامی شهرستان
                    پلیس فتا گرگان: میدان مازندران- تقاطع رسالت- ساختمان پلیس فتا


                </Text>
                <Divider height={40} />
            </Screen>
        </Screen>
    )
}

const styles = StyleSheet.create({})

